In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
dfship = pd.read_csv(r"C:\Users\hp\Desktop\Dataset_2 set\Outlier Detection\titanic.csv")

In [4]:
dfship

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
dfship

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [6]:
dfship.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Gender', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
['PassengerId',  'Name', 'Ticket', 'Fare', 'Cabin']

['PassengerId', 'Name', 'Ticket', 'Fare', 'Cabin']

In [9]:
dfship.drop(['PassengerId',  'Name', 'Ticket', 'Fare', 'Cabin'], axis = 1, inplace=True)

In [11]:
dfship.isna().sum()

Survived      0
Pclass        0
Gender        0
Age         177
SibSp         0
Parch         0
Embarked      2
dtype: int64

In [12]:
dfship.dtypes

Survived      int64
Pclass        int64
Gender       object
Age         float64
SibSp         int64
Parch         int64
Embarked     object
dtype: object

In [13]:
dfship["Age"].mean()

29.69911764705882

In [14]:
np.round(dfship["Age"].mean())

30.0

In [15]:
dfship["Age"].fillna(np.round(dfship["Age"].mean()))

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    30.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [16]:
dfship["Age"]  = dfship["Age"].fillna(np.round(dfship["Age"].mean()))

In [17]:
dfship.isna().sum()

Survived    0
Pclass      0
Gender      0
Age         0
SibSp       0
Parch       0
Embarked    2
dtype: int64

In [18]:
dfship["Embarked"].mode()

0    S
Name: Embarked, dtype: object

In [19]:
dfship["Embarked"].mode()[0]

'S'

In [20]:
dfship["Embarked"].fillna(dfship["Embarked"].mode()[0])

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [21]:
dfship["Embarked"] = dfship["Embarked"].fillna(dfship["Embarked"].mode()[0])

In [22]:
dfship.isna().sum()

Survived    0
Pclass      0
Gender      0
Age         0
SibSp       0
Parch       0
Embarked    0
dtype: int64

### Encoding

In [23]:
dfship.dtypes

Survived      int64
Pclass        int64
Gender       object
Age         float64
SibSp         int64
Parch         int64
Embarked     object
dtype: object

In [24]:
dfship

     Survived  Pclass  Gender   Age  SibSp  Parch Embarked
0           0       3    male  22.0      1      0        S
1           1       1  female  38.0      1      0        C
2           1       3  female  26.0      0      0        S
3           1       1  female  35.0      1      0        S
4           0       3    male  35.0      0      0        S
..        ...     ...     ...   ...    ...    ...      ...
886         0       2    male  27.0      0      0        S
887         1       1  female  19.0      0      0        S
888         0       3  female  30.0      1      2        S
889         1       1    male  26.0      0      0        C
890         0       3    male  32.0      0      0        Q

[891 rows x 7 columns]

In [25]:
pd.get_dummies(dfship)

,Survived,Pclass,Age,SibSp,Parch,Gender_female,Gender_male,Embarked_C,Embarked_Q,Embarked_S
0,0,3,22.0,1,0,0,1,0,0,1
1,1,1,38.0,1,0,1,0,1,0,0
2,1,3,26.0,0,0,1,0,0,0,1
3,1,1,35.0,1,0,1,0,0,0,1
4,0,3,35.0,0,0,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...
886,0,2,27.0,0,0,0,1,0,0,1
887,1,1,19.0,0,0,1,0,0,0,1
888,0,3,30.0,1,2,1,0,0,0,1
889,1,1,26.0,0,0,0,1,1,0,0
890,0,3,32.0,0,0,0,1,0,1,0

In [27]:
dfship = pd.get_dummies(dfship)

In [28]:
dfship

,Survived,Pclass,Age,SibSp,Parch,Gender_female,Gender_male,Embarked_C,Embarked_Q,Embarked_S
0,0,3,22.0,1,0,0,1,0,0,1
1,1,1,38.0,1,0,1,0,1,0,0
2,1,3,26.0,0,0,1,0,0,0,1
3,1,1,35.0,1,0,1,0,0,0,1
4,0,3,35.0,0,0,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...
886,0,2,27.0,0,0,0,1,0,0,1
887,1,1,19.0,0,0,1,0,0,0,1
888,0,3,30.0,1,2,1,0,0,0,1
889,1,1,26.0,0,0,0,1,1,0,0
890,0,3,32.0,0,0,0,1,0,1,0

###  imbalance

In [29]:
dfship["Survived"]

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [30]:
dfship["Survived"].unique()

array([0, 1], dtype=int64)

In [31]:
dfship["Survived"].value_counts()

0    549
1    342
Name: Survived, dtype: int64

### Separation

In [32]:
dfship

,Survived,Pclass,Age,SibSp,Parch,Gender_female,Gender_male,Embarked_C,Embarked_Q,Embarked_S
0,0,3,22.0,1,0,0,1,0,0,1
1,1,1,38.0,1,0,1,0,1,0,0
2,1,3,26.0,0,0,1,0,0,0,1
3,1,1,35.0,1,0,1,0,0,0,1
4,0,3,35.0,0,0,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...
886,0,2,27.0,0,0,0,1,0,0,1
887,1,1,19.0,0,0,1,0,0,0,1
888,0,3,30.0,1,2,1,0,0,0,1
889,1,1,26.0,0,0,0,1,1,0,0
890,0,3,32.0,0,0,0,1,0,1,0

In [33]:
X = dfship.drop("Survived", axis = 1)

In [34]:
X

,Pclass,Age,SibSp,Parch,Gender_female,Gender_male,Embarked_C,Embarked_Q,Embarked_S
0,3,22.0,1,0,0,1,0,0,1
1,1,38.0,1,0,1,0,1,0,0
2,3,26.0,0,0,1,0,0,0,1
3,1,35.0,1,0,1,0,0,0,1
4,3,35.0,0,0,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...
886,2,27.0,0,0,0,1,0,0,1
887,1,19.0,0,0,1,0,0,0,1
888,3,30.0,1,2,1,0,0,0,1
889,1,26.0,0,0,0,1,1,0,0
890,3,32.0,0,0,0,1,0,1,0

In [35]:
y = dfship["Survived"]

In [36]:
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

### Splitting

In [37]:
from sklearn.model_selection import train_test_split

In [70]:
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size= 20, random_state=42)

In [71]:
X_train.head()

,Pclass,Age,SibSp,Parch,Gender_female,Gender_male,Embarked_C,Embarked_Q,Embarked_S
294,3,24.0,0,0,0,1,0,0,1
447,1,34.0,0,0,0,1,0,0,1
192,3,19.0,1,0,1,0,0,0,1
682,3,20.0,0,0,0,1,0,0,1
538,3,30.0,0,0,0,1,0,0,1

In [51]:
X_train.shape

(871, 9)

In [52]:
X_test.shape

(20, 9)

In [53]:
X.shape

(891, 9)

In [54]:
y.shape

(891,)

In [55]:
y_train.shape

(871,)

In [56]:
y_test.shape

(20,)

### Model Building

In [57]:
from sklearn.linear_model import LogisticRegression

In [58]:
logreg = LogisticRegression()

In [59]:
logreg

LogisticRegression()

In [60]:
logreg.fit(X_train, y_train)

C:\Users\hp\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:814: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [61]:
logreg.score(X_test, y_test)

0.9

### Auto ML

In [76]:
from sklearn.svm import SVC
from sklearn.tree import DecisionTreeClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.ensemble import RandomForestClassifier, AdaBoostClassifier, GradientBoostingClassifier
from xgboost import XGBClassifier

In [77]:
svm_model = SVC()
dtree = DecisionTreeClassifier()
knn = KNeighborsClassifier()
rfc = RandomForestClassifier()
abc = AdaBoostClassifier()
gbc = GradientBoostingClassifier()
xgb = XGBClassifier()

In [78]:
mlist = [svm_model, dtree, knn, rfc, abc, gbc, xgb]

In [80]:
import time

In [81]:
for m in mlist :
    m.fit(X_train, y_train)
    sc = m.score(X_test, y_test)
    print(m,end = " == ")
    print(sc)
    print()
    print("********************************")
    print()
    time.sleep(2)

SVC() == 0.6

********************************

DecisionTreeClassifier() == 0.8

********************************

C:\Users\hp\anaconda3\lib\site-packages\sklearn\neighbors\_classification.py:228: FutureWarning: Unlike other reduction functions (e.g. `skew`, `kurtosis`), the default behavior of `mode` typically preserves the axis it acts along. In SciPy 1.11.0, this behavior will change: the default value of `keepdims` will become False, the `axis` over which the statistic is taken will be eliminated, and the value None will no longer be accepted. Set `keepdims` to True or False to avoid this warning.
  mode, _ = stats.mode(_y[neigh_ind, k], axis=1)

KNeighborsClassifier() == 0.8

********************************

RandomForestClassifier() == 0.85

********************************

AdaBoostClassifier() == 0.9

********************************

GradientBoostingClassifier() == 0.85

********************************

XGBClassifier(base_score=None, booster=None, callbacks=None,
              colsample_bylevel=None, colsample_bynode=None,
              colsample_bytree=None, early_stopping_rounds=None,
              enable_categorical=False, eval_metric=None, feature_types=None,
              gamma=None, gpu_id=None, grow_policy=None, importance_type=None,
              interaction_constraints=None, learning_rate=None, max_bin=None,
              max_cat_threshold=None, max_cat_to_onehot=None,
              max_delta_step=None, max_depth=None, max_leaves=None,
              min_child_weight=None, missing=nan, monotone_constraints=None,
              n_estimators=100, n_jobs=None, num_parallel_tree=None,
              predictor=None, random_state=None, ...) == 0.8

********************************